espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/efp/src/sl_efp.c
/***************************************************************************//**
 * @file
 * @brief EFP (Energy Friendly PMIC) driver.
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.  This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/
#include "em_assert.h"
#include "em_common.h"
#include "em_cmu.h"
#include "em_core.h"
#include "em_emu.h"
#include "em_gpio.h"
#include "em_se.h"
#include "sl_efp.h"
#include "sl_i2cspm.h"
#include <math.h>
#include <stdio.h>
#include <stdbool.h>

/***************************************************************************//**
 * @addtogroup extdrv
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup SL_EFP
 * @{
 ******************************************************************************/

/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN

#define EFP_EFP01_I2C_ADDR   0x60

static sl_efp_handle_t host_efp = NULL;
static CORE_DECLARE_IRQ_STATE;

static sl_status_t sl_efp_decouple_handoff(sl_efp_handle_t handle, uint8_t bk_iri_con, uint8_t bk_ton_max, uint8_t bk_ipk);

/***************************************************************************//**
 * @brief
 *   Configure I2C GPIO pins.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] enable
 *   If true, configure I2C pins for I2C use. If false, pins are configured as
 *   GPIO pins to enable "direct mode" EM transfer mode.
 ******************************************************************************/
static void enable_i2c_pins(sl_efp_handle_t handle, bool enable)
{
  if (enable) {
    handle->in_direct_mode = false;
    GPIO_PinModeSet(handle->init_data.i2c_sda_port, handle->init_data.i2c_sda_pin,
                    gpioModeWiredAnd, 1);
    GPIO_PinModeSet(handle->init_data.i2c_scl_port, handle->init_data.i2c_scl_pin,
                    gpioModeWiredAnd, 1);

    // Enable I2C module and clock.
    CMU_ClockEnable(handle->i2c_clock, true);
    I2C_Enable(handle->init_data.i2c_peripheral, true);

#if defined(_SILICON_LABS_32B_SERIES_0)
    handle->init_data.i2c_peripheral->ROUTE |= I2C_ROUTE_SDAPEN | I2C_ROUTE_SCLPEN;
#elif defined(_SILICON_LABS_32B_SERIES_1)
    handle->init_data.i2c_peripheral->ROUTEPEN |= I2C_ROUTEPEN_SDAPEN | I2C_ROUTEPEN_SCLPEN;
#elif defined(_SILICON_LABS_32B_SERIES_2)
    GPIO->I2CROUTE[handle->i2c_peripheral_index].ROUTEEN |= GPIO_I2C_ROUTEEN_SDAPEN
                                                         | GPIO_I2C_ROUTEEN_SCLPEN;
#endif
  } else {
    handle->in_direct_mode = true;
    GPIO_PinModeSet(handle->init_data.i2c_sda_port, handle->init_data.i2c_sda_pin,
                    gpioModePushPull, 1);
    GPIO_PinModeSet(handle->init_data.i2c_scl_port, handle->init_data.i2c_scl_pin,
                    gpioModePushPull, 1);

#if defined(_SILICON_LABS_32B_SERIES_0)
    init_data.i2c_instance->ROUTE &= ~(I2C_ROUTE_SDAPEN | I2C_ROUTE_SCLPEN);
#elif defined(_SILICON_LABS_32B_SERIES_1)
    handle->init_data.i2c_peripheral->ROUTEPEN &= ~(I2C_ROUTEPEN_SDAPEN
                                                  | I2C_ROUTEPEN_SCLPEN);
#elif defined(_SILICON_LABS_32B_SERIES_2)
    GPIO->I2CROUTE[handle->i2c_peripheral_index].ROUTEEN &= ~(GPIO_I2C_ROUTEEN_SDAPEN
                                                            | GPIO_I2C_ROUTEEN_SCLPEN);
#endif

    // Disable I2C module and clock to save energy.
    I2C_Enable(handle->init_data.i2c_peripheral, false);
    CMU_ClockEnable(handle->i2c_clock, false);
  }
}

/***************************************************************************//**
 * @brief
 *   Perform a VDD measurement.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] msn_addr
 *   Register address of the most significant byte of measurement.
 *
 * @param[in] lsby_addr
 *   Register address of the least significant byte of measurement.
 *
 * @param[out] voltage_mv
 *   The result of the VDD measurement.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
static sl_status_t get_vdd(sl_efp_handle_t handle,
                           uint8_t msn_addr,
                           uint8_t lsby_addr,
                           uint16_t *voltage_mv)
{
  sl_status_t ret_val;
  uint16_t read_value = 0;
  uint8_t adc_cc_ctrl, tmp, ss_mode;

  // Get ADC_INTERVAL value.
  ret_val = sl_efp_read_register(handle, EFP01_ADC_CC_CTRL, &adc_cc_ctrl);

  if (ret_val == SL_STATUS_OK) {
    if ((adc_cc_ctrl & _EFP01_ADC_CC_CTRL_ADC_INTERVAL_MASK) == 0) {
      // Issue an ADC start command if automated measurements are not enabled.
      ret_val = sl_efp_write_register(handle,
                                      EFP01_CMD,
                                      _EFP01_CMD_ADC_START_MASK);
    }
  }

  // Wait at least 18.5 usec for the result, read of SS mode provides the delay.
  if (ret_val == SL_STATUS_OK) {
    ret_val = sl_efp_read_register(handle, EFP01_CC_MODE, &ss_mode);
  }

  if (ret_val == SL_STATUS_OK) {                    // Read result MSB.
    ret_val = sl_efp_read_register(handle, msn_addr, &tmp);
  }

  if (ret_val == SL_STATUS_OK) {                    // Read result LSB.
    read_value = tmp << 8;
    ret_val = sl_efp_read_register(handle, lsby_addr, &tmp);
  }

  if (ret_val == SL_STATUS_OK) {                    // Scale result correctly.
    read_value |= tmp;
    if (ss_mode & _EFP01_CC_MODE_SC_MODE_MASK) {
      // Result is a VDDA measurement.
      *voltage_mv = (uint16_t)lroundf(read_value * 1.01f);
    } else {
      // Result is a VDDB measurement.
      *voltage_mv = (uint16_t)lroundf(read_value * 1.49f);
    }
  }

