espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/efp/src/sl_efp.c
  return ret_val;
}

/// @endcond

#if defined(_SILICON_LABS_32B_SERIES_2) && defined(EMU_VSCALE_PRESENT)
/***************************************************************************//**
 * @brief
 *   Reimplementation of the EMU function with the same name
 *
 * @details
 *   This function is called by EMU_VScaleEM01 to let EFP know that voltage scaling
 *   is requested.
 *
 * @param[in] voltage
 *   Voltage to set in EFP.
 ******************************************************************************/
void EMU_EFPEM01VScale(EMU_VScaleEM01_TypeDef voltage)
{
  /*
   * Apply voltage scaling only if EFP is powering DECOUPLE
   */
  if (host_efp != NULL && host_efp->init_data.handoff_size > 0) {
    if (voltage == emuVScaleEM01_HighPerformance) {
      sl_efp_set_vob_em01_voltage(host_efp, 1100);
    } else if (voltage == emuVScaleEM01_LowPower) {
      sl_efp_set_vob_em01_voltage(host_efp, 1000);
    }
  }
}
#endif

/***************************************************************************//**
 * @brief
 *   Reimplementation of the EMU function with the same name.
 *
 * @details
 *   This function will be called upon wakeup from the _WFI() instruction in
 *   EMU_EnterEM2/3() functions and will set the EFP in EM0 mode.
 *   A critical section is used to get predictable EFP energy mode sequence
 *   timing.
 ******************************************************************************/
void EMU_EFPEM23PostsleepHook(void)
{
  if (host_efp != NULL) {
    sl_efp_enter_em0(host_efp);
    CORE_EXIT_CRITICAL();
  }
}

/***************************************************************************//**
 * @brief
 *   Reimplementation of the EMU function with the same name.
 *
 * @details
 *   This function will be called prior to the _WFI() instruction in
 *   EMU_EnterEM2/3() functions and will set the EFP in EM2 mode.
 *   A critical section is used to get predictable EFP energy mode sequence
 *   timing.
 ******************************************************************************/
void EMU_EFPEM23PresleepHook(void)
{
  if (host_efp != NULL) {

    CORE_ENTER_CRITICAL();

    if ((host_efp->init_data.em_transition_mode == efp_em_transition_mode_gpio_bitbang)
     || (host_efp->init_data.em_transition_mode == efp_em_transition_mode_i2c)) {
      sl_efp_enter_em2(host_efp);
    } else if(host_efp->init_data.em_transition_mode == efp_em_transition_mode_emu) {
      if (!host_efp->in_direct_mode) {
        sl_efp_enable_direct_mode(host_efp);
      }
    }
  }
}

#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
/***************************************************************************//**
 * @brief
 *   Reimplementation of the EMU function with the same name.
 *
 * @details
 *   It will be called in EMU_EnterEM4(). It makes sure that direct mode is enabled
 *   so when MCU enters EM4, EMU will send a command to EFP to pass to EM4 as well.
 *
 * @warning
 *   EFP in EM4 mode is supported only on devices that have Direct Mode hardware
 *   support integrated in EMU (EFRxG22 and later devices). So this requires
 *   init_data.em_transition_mode == efp_em_transition_mode_emu.
 *
 * @note
 *   This function enables direct mode if necessary.
 ******************************************************************************/
void EMU_EFPEM4PresleepHook(void)
{
  if (host_efp != NULL) {
    if (host_efp->init_data.em_transition_mode == efp_em_transition_mode_emu) {

      if (!host_efp->in_direct_mode) {
        sl_efp_enable_direct_mode(host_efp);
      }

      EMU_EFPDriveDecoupleSet(false); // Clear EFPDRVDECOUPLE to re-enable internal LDO (if disabled)
    }
  }
}
#endif

/***************************************************************************//**
 * @brief
 *   Enable direct mode in EFP and EMU. And configure I2C pins for bitbang EM
 *   transfer mode.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @note
 *   This must be the last EFP driver function called prior to entering EM2/3
 *   via EMU_EnterEMx() calls. Any EFP API call that involves an I2C transfer
 *   will leave the I2C GPIO pins in I2C mode.
 *
 * @return
 *   SL_STATUS_OK on success.
 *   SL_STATUS_INVALID_MODE if current EM transfer mode is I2C.
 *   SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_enable_direct_mode(sl_efp_handle_t handle)
{
  sl_status_t ret_val = SL_STATUS_OK;

  if (handle->init_data.em_transition_mode == efp_em_transition_mode_i2c) {
    return SL_STATUS_INVALID_MODE;
  }
  if (handle->in_direct_mode) {
    return SL_STATUS_OK;
  }

  ret_val = sl_efp_write_register_field(handle,
                                      EFP01_EM_CRSREG_CTRL,
                                      1 << _EFP01_EM_CRSREG_CTRL_DIRECT_MODE_EN_SHIFT,
                                      _EFP01_EM_CRSREG_CTRL_DIRECT_MODE_EN_MASK,
                                      _EFP01_EM_CRSREG_CTRL_DIRECT_MODE_EN_SHIFT);

  if (handle->init_data.em_transition_mode == efp_em_transition_mode_gpio_bitbang) {
    enable_i2c_pins(handle, false);
  }
#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
  else {
    EMU_EFPDirectModeEnable(true);
    handle->in_direct_mode = true;
  }
#endif

  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Set EFP in EM0 energy mode.
 *
 * @note
 *   This function enables direct mode if necessary.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_enter_em0(sl_efp_handle_t handle)
{
  sl_status_t ret_val = SL_STATUS_OK;

  if (handle->init_data.em_transition_mode == efp_em_transition_mode_gpio_bitbang) {
#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
    EMU_EFPDirectModeEnable(false);
#endif
    if (!handle->in_direct_mode) {
      ret_val = sl_efp_enable_direct_mode(handle);
    }
    GPIO_PinOutSet(handle->init_data.i2c_scl_port, handle->init_data.i2c_scl_pin);
  } else if (handle->init_data.em_transition_mode == efp_em_transition_mode_i2c) {
#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
    EMU_EFPDirectModeEnable(false);
#endif
    ret_val = sl_efp_write_register(handle, EFP01_EM_CRSREG_CTRL, handle->em_ctrl);
  }
#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
  else if (handle->init_data.em_transition_mode == efp_em_transition_mode_emu) {
    // In this mode, EMU handles EM transition in EFP.
    return SL_STATUS_FAIL;
  }
#endif

