espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/efp/src/sl_efp.c
  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Set EFP in EM2 energy mode.
 *
 * @note
 *   This function enables direct mode if necessary.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_enter_em2(sl_efp_handle_t handle)
{
  uint8_t tmp;
  sl_status_t ret_val = SL_STATUS_OK;

  if (handle->init_data.em_transition_mode == efp_em_transition_mode_gpio_bitbang) {
#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
    EMU_EFPDirectModeEnable(false);
#endif
    if (!handle->in_direct_mode) {
      ret_val = sl_efp_enable_direct_mode(handle);
    }
    GPIO_PinOutSet(handle->init_data.i2c_scl_port, handle->init_data.i2c_scl_pin);
  } else if (handle->init_data.em_transition_mode == efp_em_transition_mode_i2c) {
#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
    EMU_EFPDirectModeEnable(false);
#endif
    ret_val = sl_efp_read_register(handle, EFP01_EM_CRSREG_CTRL, &handle->em_ctrl);

    if (ret_val == SL_STATUS_OK) {
      tmp = (handle->em_ctrl & ~_EFP01_EM_CRSREG_CTRL_EM_SEL_MASK)
            | (_EFP01_EM_CRSREG_CTRL_EM_SEL_EM2
               << _EFP01_EM_CRSREG_CTRL_EM_SEL_SHIFT);
      ret_val = sl_efp_write_register(handle, EFP01_EM_CRSREG_CTRL, tmp);
    }

    if (!handle->in_direct_mode) {
      // Disable I2C module, pins and clock to save energy.
      enable_i2c_pins(handle, false);
    }
  }
#if defined(_EMU_CTRL_EFPDIRECTMODEEN_SHIFT)
  else if (handle->init_data.em_transition_mode == efp_em_transition_mode_emu) {
    // In this mode, EMU handles EM transition of EFP.
    return SL_STATUS_FAIL;
  }
#endif

  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Measure average VDD.
 *
 * @note
 *   This function measures VDDA or VDDB depending of the voltage on the
 *   VDDA pin after power on. If VDDA is powered this function returns a VDDA
 *   reading, otherwise a VDDB reading is returned.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[out] voltage_mv
 *   Average VDD voltage expressed in millivolts.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_get_vdd_avg(sl_efp_handle_t handle, uint16_t *voltage_mv)
{
  return get_vdd(handle, EFP01_VDD_AVG_MSN, EFP01_VDD_AVG_LSBY, voltage_mv);
}

/***************************************************************************//**
 * @brief
 *   Measure maximum VDD.
 *
 * @note
 *   This function measures VDDA or VDDB depending of the voltage on the
 *   VDDA pin after power on. If VDDA is powered this function returns a VDDA
 *   reading, otherwise a VDDB reading is returned.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[out] voltage_mv
 *   Maximum VDD voltage expressed in millivolts.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_get_vdd_max(sl_efp_handle_t handle, uint16_t *voltage_mv)
{
  return get_vdd(handle, EFP01_VDD_MAX_MSN, EFP01_VDD_MAX_LSBY, voltage_mv);
}

/***************************************************************************//**
 * @brief
 *   Measure minimum VDD.
 *
 * @note
 *   This function measures VDDA or VDDB depending of the voltage on the
 *   VDDA pin after power on. If VDDA is powered this function returns a VDDA
 *   reading, otherwise a VDDB reading is returned.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[out] voltage_mv
 *   Minimum VDD voltage expressed in miilivolts.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_get_vdd_min(sl_efp_handle_t handle, uint16_t *voltage_mv)
{
  return get_vdd(handle, EFP01_VDD_MIN_MSN, EFP01_VDD_MIN_LSBY, voltage_mv);
}

/***************************************************************************//**
 * @brief
 *   Deinitialize EFP driver and underlying EFP hardware.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @return
 *   SL_STATUS_OK if successful or an error code otherwise.
 ******************************************************************************/
sl_status_t sl_efp_deinit(sl_efp_handle_t handle)
{
  if (host_efp == handle) {
    host_efp = NULL;
  }
  enable_i2c_pins(handle, false);
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Turn the internal EMU LDO regulator that supplies DECOUPLE pin on or off.
 *
 * @note
 *   Make sure that an external source supply the DECOUPLE pin before turning the
 *   LDO off.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] enable
 *   True to turn LDO on, false to turn off.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_NOT_SUPPORTED, or SL_STATUS_FAIL if not a host
 *   EFP instance.
 ******************************************************************************/
sl_status_t sl_efp_emu_ldo_enable(sl_efp_handle_t handle, bool enable)
{
  if (handle->init_data.is_host_efp) {
#if defined(_SILICON_LABS_32B_SERIES_1)
    if (enable) {
      *(volatile uint32_t*)0x400E303C &= ~0x00000040UL;
    } else {
      *(volatile uint32_t*)0x400E303C |= 0x00000040UL;
    }
    return SL_STATUS_OK;
#elif defined(_SILICON_LABS_32B_SERIES_2_CONFIG_1)
    SE_Command_t command = SE_COMMAND_DEFAULT(SE_COMMAND_PROTECTED_REGISTER |
                                              SE_COMMAND_OPTION_WRITE);
    SE_addParameter(&command, 0x4000408c);    // Address
    SE_addParameter(&command, 1 << 14);       // Mask
    if (enable) {
      SE_addParameter(&command, 0);           // Value
    } else {
      SE_addParameter(&command, 1 << 14);     // Value
    }

