espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/efp/src/sl_efp.c
    SE_executeCommand(&command);
    if (SE_readCommandResponse() != SE_RESPONSE_OK) {
      return SL_STATUS_FAIL;
    }
    return SL_STATUS_OK;
#elif defined(_EMU_CTRL_EFPDRVDECOUPLE_SHIFT)

    EMU_EFPDriveDecoupleSet(!enable);

    return SL_STATUS_OK;
#else
#warning "Internal LDO control not implemented for this device family."
    EFM_ASSERT(false);
    return SL_STATUS_NOT_SUPPORTED;
#endif

  } else {
    return SL_STATUS_FAIL; // This is not a host EFP instance.
  }
}

/***************************************************************************//**
 * @brief
 *   Initialize EFP driver and configure underlying EFP hardware.
 *
 * @note This function must not be called from interrupt context.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] init
 *   Initialization data structure.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors, or SL_STATUS_FAIL
 *   on illegal initialization.
 ******************************************************************************/
sl_status_t sl_efp_init(sl_efp_handle_t handle, const sl_efp_init_data_t *init)
{
  int i;
  uint8_t *p;
  uint8_t tmp = 0;
  sl_status_t ret_val;

  if (init->is_host_efp) {
    if (host_efp == NULL) {
      host_efp = handle;
    } else {
      return SL_STATUS_FAIL;  // Only allow one host EFP instance.
    }
  }

  // Keep a copy of init data in the handle.
  handle->init_data = *init;

  // Assemble an I2C SPM initialization structure.
  I2CSPM_Init_TypeDef i2c_init = {
    .port              = init->i2c_peripheral,
    .sclPort           = init->i2c_scl_port,
    .sclPin            = init->i2c_scl_pin,
    .sdaPort           = init->i2c_sda_port,
    .sdaPin            = init->i2c_sda_pin,
#if defined(_SILICON_LABS_32B_SERIES_0)
    .portLocation;   = init->i2c_port_location,
#elif defined(_SILICON_LABS_32B_SERIES_1)
    .portLocationScl = init->i2c_scl_port_location,
    .portLocationSda = init->i2c_sda_port_location,
#endif
    .i2cRefFreq        = 0,
    .i2cMaxFreq        = I2C_FREQ_FASTPLUS_MAX,
    .i2cClhr           = i2cClockHLRStandard
  };

  if ( false ) {
#if defined(I2C0)
  } else if (init->i2c_peripheral == I2C0) {
    handle->i2c_clock = cmuClock_I2C0;
#if defined(_SILICON_LABS_32B_SERIES_2)
    handle->i2c_peripheral_index = 0;
#endif
#endif
#if defined(I2C1)
  } else if (init->i2c_peripheral == I2C1) {
    handle->i2c_clock = cmuClock_I2C1;
#if defined(_SILICON_LABS_32B_SERIES_2)
    handle->i2c_peripheral_index = 1;
#endif
#endif
#if defined(I2C2)
  } else if (init->i2c_peripheral == I2C2) {
    handle->i2c_clock = cmuClock_I2C2;
#if defined(_SILICON_LABS_32B_SERIES_2)
    handle->i2c_peripheral_index = 2;
#endif
#endif
  }

  // Initialize I2C interface.
  I2CSPM_Init(&i2c_init);
  handle->in_direct_mode = false;

  /* Reset EFP01 to its default, out-of-reset register configuration.
     Note that EFP01's registers will only be reset to defaults by one of the below
     events:
     1) Cycling power to EFP01.  Forces a EFP POR Reset.
     2) Writing a 1 to EFP01's CMD.OTPREREAD bit. Causes the OTP defaults to be reloaded
     3) Writing a 1 to EFP01's CMD.RESET bit. Causes the EFP01 to reset its registers to 0,
      then immediately reload OTP defaults. Not recommended for use (see notes on sl_efp_reset() function)

     EFP01's registers will *not* be reset during EFR32 debug
     (e.g, after downloading an image or issuing a reset) or when the host processor is reset.
     When debugging, it may be desirable to force EFP01 to out-of-reset defaults
     during initialization - otherwise EFP01 will retain all register configurations
     written since the last system power cycle or EFP01 reset.

     Warning! When powering DECOUPLE, the internal LDO needs to be re-enabled *before* resetting EFP to default
     EFP will default to DECOUPLE DCDC off, so a brown-out will occur if the internal LDO is not enabled. */
  if (init->reset_to_default) {
    sl_efp_emu_ldo_enable(handle, true);
    ret_val = sl_efp_reset_to_default(handle);
  }

  // Enable I2C bus internal pullups and slow mode.
  // Note: Can be removed when all old EFP boards are obsoleted.
  ret_val = sl_efp_write_register(handle, EFP01_I2C_CTRL, 0x09);

  enable_i2c_pins(handle, true);

  // Do configuration register writes if a configuration is defined.
  if (init->config_size > 0) {
    i = init->config_size;
    p = init->config_data;
    while (i && (ret_val == SL_STATUS_OK)) {
      ret_val = sl_efp_write_register(handle, *p, *(p + 1));
      i--;
      p += 2;
    }
  }

#if defined(EMU_CTRL_EFPDRVDVDD)
    EMU_EFPDriveDvddSet(true);
#endif

  // Configure GPIO pin as EFP IRQ input.
  if ((init->irq_pin_mode != efp_irq_pin_disabled) && (ret_val == SL_STATUS_OK)) {
    // Clear interrupt flags.
    ret_val  = sl_efp_read_register(handle, EFP01_STATUS_G, &tmp);
    ret_val |= sl_efp_write_register(handle, EFP01_STATUS_G, tmp);
    ret_val |= sl_efp_read_register(handle, EFP01_STATUS_V, &tmp);
    ret_val |= sl_efp_write_register(handle, EFP01_STATUS_V, tmp);
#if defined(EMU_CTRL_EFPDRVDVDD)
    if (init->irq_pin_mode == efp_irq_pin_emu) {
      if (ret_val == SL_STATUS_OK) {
          GPIO_PinModeSet(init->irq_port, init->irq_pin, gpioModeInput, 1);
      }

      /* Get and clear all pending EMU EFP interrupts */
      uint32_t interruptMask = EMU_EFPIntGet();
      EMU_EFPIntClear(interruptMask);
      EMU_EFPIntEnable(1U << _EMU_EFPIEN_EFPIEN_SHIFT); // Set EFPIEN to enable EMU IRQ
    }
# else
    if (ret_val == SL_STATUS_OK) {
      GPIO_PinModeSet(init->irq_port, init->irq_pin, gpioModeInputPull, 1);
    }
#endif
  }

  // Prepare prelim workaround to speed-up EM2 wakeup timing.
  ret_val = sl_efp_read_register(handle, EFP01_EM_CRSREG_CTRL, &handle->em_ctrl);
  handle->em_ctrl &= ~_EFP01_EM_CRSREG_CTRL_EM_SEL_MASK;

  // Do decouple handoff routine if handoff parameters are defined.
  if (init->handoff_size > 0) {
    p = init->handoff_parameters;
    uint8_t iri_con = *(p);
    p++;
    uint8_t ton_max = *(p);
    p++;
    uint8_t bk_ipk = *(p);
    ret_val = sl_efp_decouple_handoff(handle, iri_con, ton_max, bk_ipk);
  }

  // Prepare for "direct mode" EM transitions.
  if ((init->em_transition_mode == efp_em_transition_mode_gpio_bitbang
    || init->em_transition_mode == efp_em_transition_mode_emu)
    && (ret_val == SL_STATUS_OK)) {
    ret_val = sl_efp_enable_direct_mode(handle);
  }

