espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/efp/src/sl_efp.c
  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Perform DECOUPLE LDO->DCDC Handoff sequence
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] bk_iri_con
 *   Desired current limit
 *
 * @param[in] bk_ton_max
 *   Desired TON MAX.
 *
 * @param[in] bk_ipk
 *   Desired peak current.
 ******************************************************************************/
static sl_status_t sl_efp_decouple_handoff(sl_efp_handle_t handle, uint8_t bk_iri_con, uint8_t bk_ton_max, uint8_t bk_ipk)
{
  sl_status_t status;
  sl_status_t ret_val;
  uint8_t tmp;

  // Set VOB target to higher level to guarantee it will overdrive the EFR32 DECOUPLE LDO output
#if defined(EMU_VSCALE_PRESENT)
  // Read EM01 VSCALE setting
  EMU_VScaleEM01_TypeDef em01VScale = EMU_VScaleGet();
  if (em01VScale == emuVScaleEM01_LowPower) {
#if defined(_SILICON_LABS_32B_SERIES_2)
    sl_efp_set_vob_em01_voltage(handle, 1050);
#else
    sl_efp_set_vob_em01_voltage(handle, 950);
#endif
  } else {
    sl_efp_set_vob_em01_voltage(handle, 1150);
  }
#elif defined(_SILICON_LABS_32B_SERIES_1)
  sl_efp_set_vob_em01_voltage(handle, 1130);
#else // For Series 1.  Note Series 1 Voltage scaling not supported in here at the moment
  sl_efp_set_vob_em01_voltage(handle, 1130);
#endif

  // Set peak current to minimum
  sl_efp_write_register_field(handle, EFP01_BK_IPK, 0,
                              _EFP01_BK_IPK_BK_IPK_MASK,
                              _EFP01_BK_IPK_BK_IPK_SHIFT);

  // Set Ton time to minimum
  sl_efp_write_register_field(handle, EFP01_BK_CTRL1,
                              1,
                              _EFP01_BK_CTRL1_BK_TON_MAX_MASK,
                              _EFP01_BK_CTRL1_BK_TON_MAX_SHIFT);

  // Set current limit to maximum
  sl_efp_write_register_field(handle, EFP01_BK_CTRL2,
                              15,
                              _EFP01_BK_CTRL2_BK_IRI_CON_MASK,
                              _EFP01_BK_CTRL2_BK_IRI_CON_SHIFT);

  // Enable VOB DCDC in buck only mode
  sl_efp_set_vob_mode(handle, efp_vob_mode_buck);

  // Make sure VOB output is ready before turning off internal LDO regulator.
  do {
    status = sl_efp_read_register(handle, EFP01_STATUS_LIVE, &tmp);
  } while (((tmp & _EFP01_STATUS_LIVE_VOB_INREG_LIVE_MASK) == 0)
           || (status != SL_STATUS_OK));

  // Set desired peak current
  sl_efp_write_register_field(handle, EFP01_BK_IPK, bk_ipk,
                              _EFP01_BK_IPK_BK_IPK_MASK,
                              _EFP01_BK_IPK_BK_IPK_SHIFT);

  // Set desired TON MAX
  sl_efp_write_register_field(handle, EFP01_BK_CTRL1,
                              bk_ton_max,
                              _EFP01_BK_CTRL1_BK_TON_MAX_MASK,
                              _EFP01_BK_CTRL1_BK_TON_MAX_SHIFT);

  // Set desired current limit
  sl_efp_write_register_field(handle, EFP01_BK_CTRL2,
                              bk_iri_con,
                              _EFP01_BK_CTRL2_BK_IRI_CON_MASK,
                              _EFP01_BK_CTRL2_BK_IRI_CON_SHIFT);

  // Turn off internal EFR32 LDO regulator.
  ret_val = sl_efp_emu_ldo_enable(handle, false);

  if (ret_val != SL_STATUS_OK){
    return ret_val;
  }

  // If voltage scaling is supported, set desired EM23 VOB voltage based of the
  // EMU configuration
#if defined(EMU_VSCALE_PRESENT)
  // Set desired EM01 VOB voltage
  if (em01VScale == emuVScaleEM01_LowPower) {
#if defined(_SILICON_LABS_32B_SERIES_2)
    ret_val = sl_efp_set_vob_em01_voltage(handle, 1000);
#else
    ret_val = sl_efp_set_vob_em01_voltage(handle, 900);
#endif
  } else {
    ret_val = sl_efp_set_vob_em01_voltage(handle, 1100);
  }
  // Read EM23VSCALE setting
  EMU_VScaleEM23_TypeDef em23VScale = (EMU_VScaleEM23_TypeDef)((EMU->CTRL & _EMU_CTRL_EM23VSCALE_MASK)
                                                               >> _EMU_CTRL_EM23VSCALE_SHIFT);
  if (em23VScale == emuVScaleEM23_LowPower) {
    ret_val = sl_efp_set_vob_em23_voltage(handle, 900);
  } else {
    ret_val = sl_efp_set_vob_em23_voltage(handle, 1100);
  }
#else
  ret_val = sl_efp_set_vob_em01_voltage(handle, 1100);
  ret_val = sl_efp_set_vob_em23_voltage(handle, 1100);
#endif
  return ret_val;
}

/***************************************************************************//**
 * @brief
 *   Read EFP OTP register.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[out] data
 *   The value read from the OTP register.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_read_otp(sl_efp_handle_t handle, uint8_t addr, uint8_t *data)
{
  uint8_t read_value;
  sl_status_t ret_val;

  ret_val = sl_efp_write_register(handle, 0x0F, 0x06);  // Enable OTP access.

  if (ret_val == SL_STATUS_OK) { // Need a few us delay, use reg. read as delay.
    ret_val = sl_efp_read_register(handle, EFP01_OTP_STATCTRL, &read_value);
  }

  if (ret_val == SL_STATUS_OK) {                        // Setup OTP address.
    ret_val = sl_efp_write_register(handle, EFP01_OTP_ADDR, addr & 0x7F);
  }

  if (ret_val == SL_STATUS_OK) {                        // Issue OTP read command.
    ret_val = sl_efp_write_register_field(handle,
                                          EFP01_OTP_STATCTRL,
                                          1,
                                          _EFP01_OTP_STATCTRL_CMD_READOTP_MASK,
                                          _EFP01_OTP_STATCTRL_CMD_READOTP_SHIFT);
  }

  if (ret_val == SL_STATUS_OK) { // Need a few us delay, use reg. read as delay.
    ret_val = sl_efp_read_register(handle, EFP01_OTP_STATCTRL, &read_value);
  }

  if (ret_val == SL_STATUS_OK) {                        // Readout OTP data.
    ret_val = sl_efp_read_register(handle, EFP01_OTP_RDATA, &read_value);
  }

  if (ret_val == SL_STATUS_OK) {                        // Disable OTP access.
    *data = read_value;                                 // OTP value.
    ret_val = sl_efp_write_register(handle, 0x0F, 0x00);
  }

