espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/efp/src/sl_efp.c
  l = lroundf((voltage_mv - 809.5f) / 22.3f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_VOB_EM0_V_VOB_EM0_V_MASK >> _EFP01_VOB_EM0_V_VOB_EM0_V_SHIFT);

  return sl_efp_write_register_field(handle, EFP01_VOB_EM0_V, (uint8_t)l,
                                     _EFP01_VOB_EM0_V_VOB_EM0_V_MASK,
                                     _EFP01_VOB_EM0_V_VOB_EM0_V_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB EM23 peak output current.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] ipk
 *   Target peak current setting.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_set_vob_em23_ipk(sl_efp_handle_t handle, uint8_t ipk)
{
  EFM_ASSERT(ipk < (uint8_t)(_EFP01_BK_IPK_BK_IPK_EM2_MASK >> _EFP01_BK_IPK_BK_IPK_EM2_SHIFT));

  return sl_efp_write_register_field(handle, EFP01_BK_IPK, ipk,
                                     _EFP01_BK_IPK_BK_IPK_EM2_MASK,
                                     _EFP01_BK_IPK_BK_IPK_EM2_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB EM23 peak output current.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] current_ma
 *   Target peak current expressed in milliamperes.
 *
 * @param[in] vddb_mv
 *   VDDB expressed in millivolt.
 *
 * @param[in] vob_mv
 *   VOB expressed in millivolt.
 *
 * @param[in] inductor_nh
 *   Inductor size expressed in nanohenry.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 *
 * @deprecated
 ******************************************************************************/
sl_status_t sl_efp_set_vob_em23_peak_current(sl_efp_handle_t handle,
                                             unsigned int current_ma,
                                             unsigned int vddb_mv,
                                             unsigned int vob_mv,
                                             unsigned int inductor_nh)
{
  long l;
  float f;

  f = (current_ma - 108.0f - (25.0f * (vddb_mv - vob_mv) / inductor_nh)) / 36.0f;
  l = lroundf(f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_BK_IPK_BK_IPK_EM2_MASK >> _EFP01_BK_IPK_BK_IPK_EM2_SHIFT);

  return sl_efp_write_register_field(handle, EFP01_BK_IPK, (uint8_t)l,
                                     _EFP01_BK_IPK_BK_IPK_EM2_MASK,
                                     _EFP01_BK_IPK_BK_IPK_EM2_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB EM23 output voltage.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] voltage_mv
 *   Voltage in millivolt.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_set_vob_em23_voltage(sl_efp_handle_t handle, unsigned int voltage_mv)
{
  long l;

  l = lroundf((voltage_mv - 809.5f) / 22.3f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_VOB_EM2_V_VOB_EM2_V_MASK >> _EFP01_VOB_EM2_V_VOB_EM2_V_SHIFT);

  return sl_efp_write_register(handle, EFP01_VOB_EM2_V, (uint8_t)l);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOB mode.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] mode
 *   Regulator mode.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_set_vob_mode(sl_efp_handle_t handle, sl_efp_vob_mode_t mode)
{
  return sl_efp_write_register_field(handle, EFP01_BK_CTRL1, mode,
                                     _EFP01_BK_CTRL1_BK_MODE_MASK,
                                     _EFP01_BK_CTRL1_BK_MODE_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Set regulator VOC output voltage.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] voltage_mv
 *   Voltage in millivolt.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_set_voc_voltage(sl_efp_handle_t handle, unsigned int voltage_mv)
{
  long l;

  l = lroundf((voltage_mv - 1717.8f) / 30.5f);
  l = SL_MAX(l, 0);
  l = SL_MIN(l, _EFP01_VOC_V_VOC_V_MASK >> _EFP01_VOC_V_VOC_V_SHIFT);

  return sl_efp_write_register_field(handle, EFP01_VOC_V, (uint8_t)l,
                                     _EFP01_VOC_V_VOC_V_MASK,
                                     _EFP01_VOC_V_VOC_V_SHIFT);
}

/***************************************************************************//**
 * @brief
 *   Write EFP control register.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[in] data
 *   The value to write to the register.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_write_register(sl_efp_handle_t handle, uint8_t addr, uint8_t data)
{
  I2C_TransferSeq_TypeDef seq = {
    .addr   = EFP_EFP01_I2C_ADDR,
    .flags  = I2C_FLAG_WRITE_WRITE,
    .buf[0] = { .data = &addr, .len = 1 },
    .buf[1] = { .data = &data, .len = 1 }
  };

  if (handle->in_direct_mode) {
    enable_i2c_pins(handle, true);
  }

  if (I2CSPM_Transfer(handle->init_data.i2c_peripheral, &seq) != i2cTransferDone) {
    EFM_ASSERT(false);
    return SL_STATUS_IO;
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Write EFP control register field.
 *
 * @note
 *   This function performs a read-modify-write of a EFP register.
 *
 * @param[in] handle
 *   EFP instance handle.
 *
 * @param[in] addr
 *   Register address.
 *
 * @param[in] data
 *   The value to write to the register field.
 *
 * @param[in] mask
 *   Bit mask corresponding to target bit field.
 *
 * @param[in] pos
 *   Bit number of least significant bit of target bit field.
 *
 * @return
 *   SL_STATUS_OK or SL_STATUS_IO on I2C transfer errors.
 ******************************************************************************/
sl_status_t sl_efp_write_register_field(sl_efp_handle_t handle,
                                        uint8_t addr,
                                        uint8_t data,
                                        uint8_t mask,
                                        uint8_t pos)
{
  uint8_t tmp;
  sl_status_t ret_val;

  ret_val = sl_efp_read_register(handle, addr, &tmp);
  if (ret_val == SL_STATUS_OK) {
    tmp = (tmp & ~mask) | ((data << pos) & mask);
    ret_val = sl_efp_write_register(handle, addr, tmp);
  }
  return ret_val;
}
/** @} (end addtogroup SL_EFP) */
/** @} (end addtogroup extdrv) */
